{
  "sectionLabel": "Trayectoria Profesional",
  "heading": "Experiencia",
  "current": "Actual",
  "roles": {
    "rmp-director": {
      "role": "Director de Experiencia de Usuario",
      "description": "Lideré la implementación de una nueva experiencia de usuario y el equipo de desarrollo en RunMyProcess, impulsando el rediseño completo de la plataforma con enfoque en arquitectura escalable, mejoras de UX y optimización de rendimiento. Desarrollé e integré componentes para el motor de renderizado, mejorando los tiempos de carga en un 35% y reduciendo errores visuales en un 40%. Optimicé la plataforma low-code interna reduciendo bugs en un 25% y mejorando el rendimiento de build en un 20%. Mantuve documentación técnica cubriendo más de 50 componentes en Confluence."
    },
    "rmp-senior": {
      "role": "Ingeniero de Software Senior",
      "description": "Lideré un equipo multidisciplinario de más de 8 desarrolladores y diseñadores para modernizar la landing page, el sitio de documentación y la plataforma low-code interna, aumentando el engagement de usuarios en un 25%. Encabecé un rediseño integral de UI con enfoque en arquitectura escalable y usabilidad, mejorando los puntajes en un 30%. Colaboré con equipos internacionales de India, EE.UU., Marruecos, Japón, Australia y Colombia."
    },
    "veritran-engineer": {
      "role": "Ingeniero de Software II",
      "description": "Mejoré y expandí una plataforma low-code para instituciones financieras usando React.js y TypeScript. Contribuí a la transición de la plataforma de JavaScript puro a un sistema basado en componentes. Integré Node.js y WebSockets para comunicación en tiempo real. Construí herramientas de construcción visual incluyendo guías drag & drop y ajustes de componentes basados en zoom. Mejoré el rendimiento para grandes volúmenes de datos mediante code splitting."
    },
    "veritran-consultant": {
      "role": "Consultor de Implementación",
      "description": "Apoyé la integración de la plataforma low-code en BancoEstado. Desarrollé interfaces frontend usando HTML, CSS y JavaScript para mejorar la interacción de clientes con servicios bancarios. Apliqué tecnologías frontend y backend para mejorar la accesibilidad y experiencia de usuario en plataformas financieras."
    },
    "excelascent": {
      "role": "Desarrollador Full Stack",
      "description": "Desarrollé un sistema de pago e inversión en criptomonedas con un frontend dinámico en React.js. Lideré un equipo de dos desarrolladores y un diseñador UX. Migré el proyecto a Remix.js e implementé GraphQL para unificar el esquema API. Gestioné MongoDB para grandes volúmenes de datos transaccionales."
    },
    "td7": {
      "role": "Desarrollador Web Backend",
      "description": "Desarrollé una aplicación de visualización de precios de criptomonedas en tiempo real usando Socket.io. Construí servicios backend con Express.js y MongoDB. Encabecé el desarrollo de una wallet de criptomonedas y plataforma ICO basada en Ethereum."
    },
    "onyxsoft": {
      "role": "Desarrollador de Software",
      "description": "Desarrollé aplicaciones para mejorar la gestión operacional de cadenas de restaurantes. Usé herramientas de desarrollo rápido (Webdev, Windev) para desplegar nuevas funcionalidades eficientemente. Optimicé sistemas de gestión de pedidos, procesamiento de pagos y manejo de inventario."
    }
  }
}
