{
  "sectionLabel": "Mi Trabajo",
  "heading": "Proyectos",
  "live": "Ver",
  "code": "Código",
  "liveDemo": "Demo en Vivo",
  "sourceCode": "Código Fuente",
  "items": {
    "rmp-lowcode": {
      "title": "Plataforma Low-Code RunMyProcess",
      "description": "Plataforma low-code empresarial con motor de renderizado y más de 50 componentes personalizados.",
      "longDescription": "Lideré el rediseño completo de la plataforma RunMyProcess con enfoque en arquitectura escalable, experiencia de usuario y rendimiento. Desarrollé e integré componentes para el motor de renderizado, mejorando los tiempos de carga en un 35% y reduciendo errores de renderizado visual en un 40%. Optimicé la plataforma low-code interna reduciendo bugs en un 25% y el rendimiento de build en un 20%."
    },
    "veritran-platform": {
      "title": "Plataforma Financiera VeriTran",
      "description": "Plataforma low-code para instituciones financieras con funcionalidades en tiempo real.",
      "longDescription": "Mejoré una plataforma low-code que sirve a instituciones financieras usando React.js y TypeScript. Contribuí a la transición de JavaScript puro a una arquitectura basada en componentes. Integré WebSockets para comunicación en tiempo real. Construí herramientas de construcción visual incluyendo guías drag & drop y ajustes de componentes basados en zoom. Mejoré el rendimiento mediante code splitting."
    },
    "crypto-platform": {
      "title": "Plataforma de Pagos e Inversión Crypto",
      "description": "Sistema de pagos en criptomonedas con seguimiento de precios en tiempo real.",
      "longDescription": "Construí un sistema de pago e inversión en criptomonedas con un frontend dinámico en React.js. Lideré un equipo de dos desarrolladores y un diseñador UX. Migré el proyecto a Remix.js e implementé GraphQL para unificar el esquema API. Desarrollé visualización de precios en tiempo real con Socket.io. Gestioné MongoDB para grandes volúmenes de datos transaccionales."
    },
    "compiler-pl0": {
      "title": "Compilador PL/0 en Python",
      "description": "Implementación académica de compilador para el lenguaje de programación PL/0.",
      "longDescription": "Construí un compilador completo para el lenguaje de programación PL/0 en Python como parte del trabajo de ingeniería de sistemas. Implementa las fases de análisis léxico, parsing y generación de código. Una demostración de fundamentos de ciencias de la computación y teoría de lenguajes."
    }
  }
}
