{
  "sectionLabel": "Habilidades y Experiencia",
  "heading": "Árbol de Habilidades",
  "categories": {
    "all": "Todas",
    "frontend": "Frontend",
    "backend": "Backend",
    "tools": "Herramientas",
    "design": "Diseño"
  },
  "descriptions": {
    "React": "Lideré el equipo de desarrollo detrás del rediseño de la plataforma RunMyProcess, construyendo más de 50 componentes para el motor de renderizado y mejorando los tiempos de carga en un 35%. Contribuí a la transición del código de JS puro a una arquitectura basada en componentes en VeriTran. Construí el frontend de pagos crypto en ExcelAscent.",
    "TypeScript": "Tipé el motor de renderizado low-code de RunMyProcess y más de 50 componentes UI como parte del rediseño enfocado en arquitectura escalable. Mejoré la plataforma financiera VeriTran con TypeScript estricto, reduciendo errores en tiempo de ejecución.",
    "JavaScript": "Lenguaje principal en todos los roles. Construí funcionalidades frontend interactivas, integraciones en tiempo real, y contribuí a una migración completa de JS a TypeScript en VeriTran.",
    "HTML/CSS": "Estructuré y estilé interfaces para plataformas low-code empresariales, apps financieras y sistemas de pago.",
    "Redux": "Gestioné estado complejo de aplicaciones en la plataforma low-code RunMyProcess y herramientas financieras VeriTran, incluyendo flujos de datos en tiempo real e interacciones drag & drop.",
    "Tailwind CSS": "Adoptado para desarrollo rápido de UI en RunMyProcess y proyectos personales como este portafolio, permitiendo diseños consistentes y responsivos.",
    "WebSockets": "Integré comunicación en tiempo real basada en WebSocket para la plataforma financiera VeriTran. Usé Socket.io para visualización en vivo de precios de criptomonedas en ExcelAscent.",
    "GraphQL": "Implementé GraphQL para unificar el esquema API de la plataforma de pagos crypto, reemplazando múltiples endpoints REST con una capa de consulta flexible.",
    "REST APIs": "Diseñé y consumí servicios RESTful para plataformas empresariales, integraciones financieras y sistemas de pago en múltiples empresas.",
    "Node.js": "Construí servicios backend y herramientas en VeriTran. Desarrollé lógica del servidor para la plataforma crypto en ExcelAscent y sistemas internos en TD7.",
    "Express.js": "Creé servidores API REST para el sistema de pagos crypto en ExcelAscent y servicios web backend en Tecnología Digital 7.",
    "MongoDB": "Gestioné grandes volúmenes de datos transaccionales para la plataforma de inversión crypto en ExcelAscent. Usado para persistencia de datos en TD7.",
    "Jest": "Escribí pruebas unitarias y de integración para componentes de plataforma low-code en RunMyProcess y módulos de aplicaciones financieras en VeriTran.",
    "Git": "Control de versiones y colaboración en todos los roles profesionales, gestionando bases de código con múltiples contribuidores y flujos de lanzamiento.",
    "Confluence": "Mantuve documentación técnica cubriendo más de 50 componentes para el motor de renderizado RunMyProcess y guías de plataforma interna.",
    "Figma": "Lideré el prototipado UX y diseño para el rediseño de la plataforma RunMyProcess, definiendo la nueva experiencia de usuario y colaborando con el equipo de desarrollo para implementar interfaces pixel-perfect.",
    "UI/UX Design": "Lideré la implementación de una nueva experiencia de usuario en RunMyProcess, impulsando un rediseño integral de UI que mejoró la usabilidad en un 30% y definiendo el roadmap UX en 3 líneas de producto. Construí herramientas de construcción visual con drag & drop en VeriTran."
  }
}
